

def get_value(name: str) -> float:
    output = f"""
╭────────────────────────────────────────╮
       Введите значение: {name}           
╰────────────────────────────────────────╯
╰─> """
    
    while True:
        try:
            num = float(input(output))
            return num
        except Exception:
            output = """
╭────────────────────────────────────────╮
│    Неверный ввод! Повторите попытку.   │
╰────────────────────────────────────────╯
╰─> """

B3 = get_value("B3")
B6 = get_value("B6")
result = B3 + B6

output = f"""
╭────────────────────────────────────────╮
│          РЕЗУЛЬТАТ ВЫЧИСЛЕНИЯ          │
├────────────────────────────────────────┤
     B3 + B6 = {str(int(result) if result.is_integer() else result)}
╰────────────────────────────────────────╯
"""

print(output)